/*方阵乘法运算
【问题描述】
    从键盘输入一个正整数n（n∈1,10]），表示进行乘法运算的两个整形方阵的阶。然后分别输入两个整形方阵A和B，计算A*B后将结果输出到屏幕。

【输入形式】
    从键盘输入一个正整数，然后再输入两个整形方阵。
【输出形式】
    在屏幕上输出两个整形方阵的乘积。
【输入样例】

3
1 1 1
3 3 3
6 6 6
9 9 9
6 6 6
5 5 5
【输出样例】

########20########20########20
########60########60########60
#######120#######120#######120
【样例说明】

首先输入正整数3,说明接下来要输入的方阵是3×3的。因为

1 1 1       9 9 9       20  20  20
3 3 3   ×   6 6 6   =    60  60  60
6 6 6       5 5 5       120 120 120
所以在屏幕上打印：

########20########20########20
########60########60########60
#######120#######120#######120
注："#"代表空格，每个输出的整数占10位，不足10位在整数的左边用空格补足。
*/

#include<stdio.h>
void main(){
	int N,i,j,k;
	int a[10][10],sum=0;
	int b[10][10],c[10][10]={0};
	scanf("%d",&N);
	for(i=0;i<N;i++)
		for(j=0;j<N;j++)
			scanf("%d",&a[i][j]);

	for(i=0;i<N;i++)
		for(j=0;j<N;j++)
			scanf("%d",&b[i][j]);

	for(i=0;i<N;i++)
	{
		for(j=0;j<N;j++)
		{
			sum=0;
			for(k=0;k<N;k++){
				sum+=a[i][k]*b[k][j];
				
			}
			c[i][j]+=sum;
		}		
	}
	
	for(i=0;i<N;i++)
	{
		for(j=0;j<N;j++)
			printf("%10d",c[i][j]);
		printf("\n");
	}
}








#include <stdio.h>

int main() 
{
    int n;
    scanf("%d", &n);
    int A[10][10], B[10][10], C[10][10] = {0};

    
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            scanf("%d", &A[i][j]);
        }
    }

    
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            scanf("%d", &B[i][j]);
        }
    }

   
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            for (int k = 0; k < n; k++) {
                C[i][j] += A[i][k] * B[k][j];
            }
        }
    }

   
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            printf("%10d", C[i][j]);
        }
        printf("\n");
    }

    return 0;
}